#+title: Problem Set 2
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2025-10-06>
#+lastmod: <2026-04-13 17:28>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

*** Solution
- Names: Kevin, Heather, Randy, Vijay, Abbey

#+begin_src julia :session none :results value
# s - statement
s1(K,H) = K || H
s2(R,V) = xor(R,V)
s3(A,R) = !A || R
s4(K,V) = K == V
s5(H,A,K) = !H || (A && K)

function validation(chat_list::Vector{Bool})
    K = chat_list[1]
    H = chat_list[2]
    R = chat_list[3]
    V = chat_list[4]
    A = chat_list[5]

    if s1(K, H) && s2(R, V) && s3(A, R) && s4(K, V) && s5(H, A, K)
        return true
    end

    return false
end

function get_chats()
    n = 5
    result = Vector{Vector{Bool}}()

    for mask in 0:(1 << n) - 1
        combination = Vector{Bool}()

        for j in 1:n
            if ((mask >> (j - 1)) & 1) == 1
                push!(combination, true)
            else
                push!(combination, false)
            end
        end
        if validation(combination)
            push!(result, combination)
        end
    end
    return result
end

get_chats()

#+end_src

#+RESULTS:
: Bool[1, 0, 0, 1, 0]

*** Solution
#+begin_src julia :session none :results output
using TruthTables
@truthtable P || Q && (P --> R) --> (P --> ((Q && P) || R))
#+end_src

#+RESULTS:
#+begin_example
TruthTable
вФМвФАвФАвФАвФАвФАвФАвФАвФђвФАвФАвФАвФАвФАвФАвФАвФђвФАвФАвФАвФАвФАвФАвФАвФђвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФР
вФВ   P   вФВ   Q   вФВ   R   вФВ P вИ® Q вИІ (P --> R) --> (P --> Q вИІ P вИ® R) вФВ
вФЬвФАвФАвФАвФАвФАвФАвФАвФЉвФАвФАвФАвФАвФАвФАвФАвФЉвФАвФАвФАвФАвФАвФАвФАвФЉвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФ§
вФВ true  вФВ true  вФВ true  вФВ true                                    вФВ
вФВ true  вФВ true  вФВ false вФВ true                                    вФВ
вФВ true  вФВ false вФВ true  вФВ true                                    вФВ
вФВ true  вФВ false вФВ false вФВ false                                   вФВ
вФВ false вФВ true  вФВ true  вФВ true                                    вФВ
вФВ false вФВ true  вФВ false вФВ true                                    вФВ
вФВ false вФВ false вФВ true  вФВ true                                    вФВ
вФВ false вФВ false вФВ false вФВ true                                    вФВ
вФФвФАвФАвФАвФАвФАвФАвФАвФівФАвФАвФАвФАвФАвФАвФАвФівФАвФАвФАвФАвФАвФАвФАвФівФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФАвФШ
#+end_example
